blogger/app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("username", "email", "salt", "crypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @author.update(author_params)
---
UPDATE "authors" SET "username" = ?, "email" = ?, "salt" = ?, "crypted_password" = ?, "updated_at" = ? WHERE "authors"."id" = ?